// (11). =================
// function getFullname(people) {
//   var fullname = people.title + ' ' + people.firstname + ' ' + people.lastname;
//   return fullname;
// }





// (12). =================
// == เปรียบเทียบ 2 ข้อมูล จะเป็น true เมื่อค่าของ 2 ข้อมูล เท่ากับ
// != เปรียบเทียบ 2 ข้อมูล จะเป็น true เมื่อค่าของ 2 ข้อมูล ไม่เท่ากับ
// === เปรียบเทียบ 2 ข้อมูล โดยไม่มีการพยายามแปลงชนิดข้อมูล (เปรียบเทียบแบบสนใจ type) จะเป็น true เมื่อค่า และ type ของ 2 ข้อมูล เท่ากับ
// !== เปรียบเทียบ 2 ข้อมูล โดยไม่มีการพยายามแปลงชนิดข้อมูล (เปรียบเทียบแบบสนใจ type) จะเป็น true เมื่อค่า หรือ type ของ 2 ข้อมูล ไม่เท่ากับ




// (13). =================
// function reverseText(text) {
//   return text.split("").reverse().join("")
// }




// (14). =================
// ไม่ error เพราะว่า การประกาศ Function มันจะดันตัวเองไม่สู่จุดสูงสุด
// ของขอบเขตการมองเห็นของมัน เรียกว่า Hoist





// (15). ================
// ไม่ error เพราะว่า Function ใน JavaScript สามารถเก็บไว้ในตัวแปรได้

